#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//int main()
//{
//	double a = 5 % 2.0;//商2余1
//	printf("a=%lf\n", a);
//	return 0;
//}


//int main()
//{
//	int a = -1;
//	//整数的二进制表示有：原码，反码，补码
//	//存储到内存的是补码
//	//100000000000000000000001 - 原码
//	//反码 - 符号位不变  其他位按位取反
//	//111111111111111111111110 - 反码
//	//补码 - 反码加一得到补码
//	//111111111111111111111111 - 补码
//	// >> -- 右移操作符  右移一位有除以2的效果
//算术右移  逻辑右移
//右边丢弃，左边补符号位
//	//移动的是二进制位
//	//00000000000000000000000000010000
//	//
//	int b = a >> 1;
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	int b = a << 1;
//	//00000000000000000000000000000101
//	//<<- 左边丢弃，右边补0
//   不可移动负位数  只可用于整数
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
	////& - 按二进制与
	//int a = 3;
	//int b = 5;
	//int c = a&b;
	////0000000000000000000000000000011
	////0000000000000000000000000000101
	////0000000000000000000000000000001
	//printf("%d\n", c);
	//| - 按二进制或
	/*int a = 3;
	int b = 5;
	int c = a | b;
	printf("%d\n", c);*/
	//0000000000000000000000000000011
    //0000000000000000000000000000101
	//0000000000000000000000000000111
	//^按二进制位异或
	//相同为0，相异为1
//	int a = 3;
//	int b = 5;
//	int c = a ^ b;
//	//0000000000000000000000000000011
//	//0000000000000000000000000000101
//	//0000000000000000000000000000110
//	printf("%d\n", c);
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//int tmp = 0;//临时变量
//	printf("before : a=%d b=%d\n", a, b);
//	/*tmp = a;
//	a = b;
//	b = tmp;*/
//	 
//	//加减法(不用临时变量） -  可能会溢出
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//
//	//异或的方法
//	a = a^b;
//	b = a^b;
//	a = a^b;
//	printf("after : a=%d b=%d\n", a, b);
//	return 0;
//}

//123


	//32bit
	//num&1 ==1
	//00000000000000000000000000000011
	//00000000000000000000000000000001
	//00000000000000000000000000000001

	
	//统计num的补码中有几个1
	/*while (num)
	{
		if (num % 2 == 1)
			count++;
		num = num / 2;
	}*/
	//printf("%d\n", count);
	//return 0;
//}

//int main()
//{
//	int a = 0;
//	if (a)
//	{
//		printf("呵呵\n");
//	}
//	if (!a)
//	{
//		printf("呵呵\n");
//	}
	//a = a + 2;
	//a += 2;//符合赋值符

	//a = a >> 1;
	//a >>= 1;

	//a = a & 1;
	//a &= 1;
	/*return 0;
}*/

//int main()
//{
//	int a = -5;
//	a = -a;
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int*p=&a;//取地址操作符
//	*p = 20;//解引用操作符
//	return 0;
//
//}

int main()
{
	int a = 10;
	char c = 'r';
	char*p = &c;
	int arr[10] = { 0 };
	//sizeof 计算的变量所配占内存空间的大小，单位是字节
	printf("%d\n", sizeof a);
	printf("%d\n", sizeof(int));
	printf("%d\n", sizeof(c));
	printf("%d\n", sizeof(char));
	printf("%d\n", sizeof(p));
	printf("%d\n", sizeof(char*));
	printf("%d\n", sizeof(arr));
	printf("%d\n", sizeof(int[10]));//类型不能去括号  名字可去
	return 0;

}

